app/Http/Controllers/HomeController.php

    public function index()
    {
        $categories = Category::all();
---
select * from `categories`